// Задано довільний рядок виду “isu([syvstc]ts(crs))cs”, в якому довільним чином
// можуть бути розставлені круглі або квадратні дужки, що відкриваються або
// закриваються. Напишіть функцію testString, яка визначатиме коректність
// розміщення дужок (повертає true або false). Під коректністю мається на увазі
// відсутність «перетину» різних видів дужок (наприклад, так
// “isu[syv(stc]ts(crs))cs”) або відповідність кожнії дужці, що відкривається такого
// ж типу, але такої, що закривається.

function testString(str, inside = '', beginIndex = 0) {
    str = str.replace(/[^\[\]\(\)]/g, '');

    while(str !== '') {
        let prevStr = str;

        str = str.replace(/\[\]/g, '');
        str = str.replace(/\(\)/g, '');

        if (str === prevStr) {
            return false;
        }
    }

    return true;
}
